Este es un fichero complementario a la conferencia _Dise침o Correcto. Introducci칩n a SQL_. 

El estudiante debe de buscar la definici칩n de cada sintaxis en el manual oficial de SQL.

## Recordando ...

#### 쯈u칠 es un Sistema de Gesti칩n de Bases de Datos?

Un sistema de gesti칩n de bases de datos es un sistema computacional que proporciona funcionalidades, medios o servicios para manipular todos los accesos a una base de datos o una colecci칩n de bases de datos.

#### 쮺칩mo se establece la comunicaci칩n con un SGBD?

1. Conocer la direcci칩n al servidor del sistema gestor.
2. Utilizar un cliente para el env칤o de las peticiones y recibir la respuesta.
3. El mensaje est치 definido en un dialecto entendible por el sistema gestor.

In [1]:
# Inicializamos el cliente para conectarnos al gestor de bases de datos
# Esto permite usar expresiones SQL posteriormente y ver la respuesta de cada instrucci칩n definida
%load_ext sql

Para establecer la conexi칩n con el gestor se utiliza un *connection string* que generalmente contiene la siguiente informaci칩n.

- Sistema gestor utilizado 
  - mysql
- Direcci칩n del sistema gestor 
  - ip: localhost 
  - puerto: 3306
- Credenciales de seguridad 
  - usuario: root 
  - contrase침a: 1q2w3e4r

In [3]:
# Establecemos una conexi칩n con el sistema gestor con un connection string
%sql mysql://root:root@localhost:3306

Una vez conectados podemos empezar a trabajar con SQL :), entonces...

## Data Definition Language (DDL)

### Lenguaje de definici칩n de datos

Empecemos listando las bases de datos que controla nuestro sistema gestor

In [4]:
%sql SHOW DATABASES

 * mysql://root:***@localhost:3306
15 rows affected.

[('abc',),
 ('agenciaprensa',),
 ('cinesoft',),
 ('example_database',),
 ('festivaldecine34',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('pruebafinal',),
 ('pruebafinal1ersemestre2023',),
 ('sakila',),
 ('sys',),
 ('test_database',),
 ('ventas',),
 ('world',)]

Las palabras reservadas en SQL pueden ser escritas en may칰scula o min칰scula en su totalidad, puesto que son entendibles para el SGBD.

> 游눠 Sugerencia: prueba cambiando el tema de colores del VS Code hasta que encuentres uno que resalte la sintaxis de las palabras reservadas, por ejemplo, Monokai.

Verificar la salida de la instrucci칩n:

```sql
SHOW DATABASES
```

Ahora vamos a crear nuestra primera base de datos :) con la sentencia

```sql
CREATE DATABASE [IF NOT EXISTS] <database_name>
```

El uso del cuantificador `IF NOT EXISTS` permite el control de un error en caso de que exista una base de datos con igual nombre.

In [4]:
%%sql 

CREATE DATABASE IF NOT EXISTS example_database

-- Esta es la sintaxis para definir un comentario en SQL

/* 
Probando otra sintaxis para definir comentarios dentro de una instrucci칩n
*/

 * mysql://root:***@localhost:3306
1 rows affected.

[]

Entonces eliminemos nuestra primera base de datos :( con la sentencia

```sql
DROP DATABASE [IF EXISTS] <database_name>
```

In [5]:
%sql DROP DATABASE example_database

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Una vez que hayamos definido la base de datos, estamos listos para crear tablas y trabajar con los datos.

Para esto, hay que indicar la base de datos que se utilizar치 para nuestras operaciones, utilizando la sentencia

```sql
USE <database_name>
```

In [6]:
# crear la base de datos, puesto que se elimin칩
%sql CREATE DATABASE example_database

%sql USE example_database

 * mysql://root:***@localhost:3306
1 rows affected.
 * mysql://root:***@localhost:3306
0 rows affected.

[]

### Definici칩n y manipulaci칩n de tablas

La sintaxis para definir una tabla es:

```sql 
CREATE TABLE <table_name> (<ATTRIBUTES_DEFINITIONS>, <CONSTRAINTS_DEFINITIONS>)
```

Primero definimos los atributos de la tabla

-------

**Atributos**: 

```sql
<attribute_name> <data_type> [DEFAULT <value>] [NOT NULL]
```

Y luego definimos las restricciones de integridad (llave primaria, llaves for치neas, unicidad y chequeos)

--------

**Llave primaria**:

```sql
PRIMARY KEY <attribute_name>
```

-------

**Llave for치nea**:

```sql
FOREIGN KEY <foreign_key_name> (<attributes_name>) REFERENCES <table_name>(<attributes_name>) <MODIFIERS>
```

Los modificadores de las llaves for치neas nos permiten definir el comportamiento de las mismas ante el cambio de los valores a los que referencian:

`ON DELETE`: `CASCADE`, `RESTRICT`, `SET NULL`, `SET DEFAULT`, `NO ACTION`

`ON UPDATE`: `CASCADE`, `RESTRICT`, `SET NULL`, `SET DEFAULT`, `NO ACTION`

---------

**Unicidad**:

```sql 
UNIQUE <attribute_name>
```

El modificador `UNIQUE` es el recurso que provee SQL para poder asegurar que se cumplen las restricciones impuestas por m칰ltiples llaves candidatas dentro de una misma tabla.

---------

**Chequeo**:

```sql
CHECK (<conditional_expression>)
```

In [7]:
%%sql

CREATE TABLE estudiante (
    id INT NOT NULL AUTO_INCREMENT,
    nombre CHAR(20) NOT NULL,
    grupo CHAR(4) NOT NULL,
    provincia CHAR(20) NOT NULL,
    email CHAR(30) NOT NULL UNIQUE,
    sexo BOOLEAN,
    PRIMARY KEY (id)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Para obtener informaci칩n de la estructura de una tabla, se utiliza

```sql
DESCRIBE <table_name>
```

In [8]:
%sql DESCRIBE estudiante

 * mysql://root:***@localhost:3306
6 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nombre', 'char(20)', 'NO', '', None, ''),
 ('grupo', 'char(4)', 'NO', '', None, ''),
 ('provincia', 'char(20)', 'NO', '', None, ''),
 ('email', 'char(30)', 'NO', 'UNI', None, ''),
 ('sexo', 'tinyint(1)', 'YES', '', None, '')]

In [9]:
%%sql
CREATE TABLE asignatura (
    id INT NOT NULL AUTO_INCREMENT,
    nombre CHAR(20) NOT NULL,
    horas SMALLINT DEFAULT 64,
    PRIMARY KEY (id)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [10]:
%%sql
CREATE TABLE calificacion (
    estudianteid INT NOT NULL,
    asignaturaid INT NOT NULL,
    nota SMALLINT NOT NULL,
    PRIMARY KEY (estudianteid, asignaturaid),
    FOREIGN KEY cal_est(estudianteid) REFERENCES estudiante(id) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY cal_asg(asignaturaid) REFERENCES asignatura(id) ON DELETE RESTRICT ON UPDATE CASCADE,
    CHECK(nota >=2 and nota <=5)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Si se consulta la estructura de la tabla `calificacion`, 쯣or qu칠 no se muestran todas las restricciones?

In [11]:
%sql DESCRIBE calificacion

 * mysql://root:***@localhost:3306
3 rows affected.

[('estudianteid', 'int', 'NO', 'PRI', None, ''),
 ('asignaturaid', 'int', 'NO', 'PRI', None, ''),
 ('nota', 'smallint', 'NO', '', None, '')]

Una vez que se define una tabla puede ser modificada utilizando la cl치usula `ALTER` 

```sql 
ALTER TABLE <table_name> 
    [ADD <attribute_def>]
    [ALTER <attribute_name> [SET DEFAULT, DROP DEFAULT]] 
    [DROP <attribute_name> [CASCADE, RESTRICT]] 
    [ADD, DROP <constraint_name>]
```

O eliminada utilizando `DROP`
```sql
DROP TABLE <table_name>
```

En ocasiones, para ciertos SGDB difiere la sintaxis que hereda del SQL est치ndar. Por ejemplo, en MySQL la sintaxis `ALTER <attribute_name>` se sustituye por `MODIFY COLUMN <attribute_name>`.

In [13]:
# %sql ALTER TABLE estudiante ADD no_cuenta INT NOT NULL
%sql ALTER TABLE estudiante MODIFY COLUMN no_cuenta CHAR(16) DEFAULT '000000000000000'
# %sql ALTER TABLE estudiante DROP no_cuenta

%sql DESCRIBE estudiante

 * mysql://root:***@localhost:3306
0 rows affected.
 * mysql://root:***@localhost:3306
7 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nombre', 'char(20)', 'NO', '', None, ''),
 ('grupo', 'char(4)', 'NO', '', None, ''),
 ('provincia', 'char(20)', 'NO', '', None, ''),
 ('email', 'char(30)', 'NO', 'UNI', None, ''),
 ('sexo', 'tinyint(1)', 'YES', '', None, ''),
 ('no_cuenta', 'char(16)', 'YES', '', '000000000000000', '')]

Un **칤ndice** es una estructura de almacenamiento f칤sico que permite conservar determinados valores de una o m치s columnas, para agilizar el trabajo de la manipulaci칩n de grandes conjuntos de datos.

El uso de un 칤ndice mejora el rendimiento de las consultas que utilizan dichas columnas como filtros y permite garantizar la unicidad en llaves alternativas. Sin embargo, consume espacio adicional y es necesario actualizarlo por cada operaci칩n de manipulaci칩n.

```sql
CREATE [UNIQUE] INDEX <index_name> ON <table_name> (<column_name> [ASC, DESC],...)

DROP INDEX <index_name> ON <table_name>
```

In [14]:
%sql CREATE INDEX index_email ON ESTUDIANTE (email)
# %sql DROP INDEX index_email ON ESTUDIANTE

 * mysql://root:***@localhost:3306
0 rows affected.

[]

La instrucci칩n 

```sql
SHOW INDEX <index_name> ON <table_name>
```

muestra los 칤ndices asociados a una tabla. Por defecto, la llave primaria de la tabla es el 칤ndice que primero se asegura por el gestor de la base de datos.

In [15]:
%sql SHOW INDEX FROM estudiante

 * mysql://root:***@localhost:3306
3 rows affected.

[('estudiante', 0, 'PRIMARY', 1, 'id', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None),
 ('estudiante', 0, 'email', 1, 'email', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None),
 ('estudiante', 1, 'index_email', 1, 'email', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None)]

### Particionamiento

El particionamiento de una tabla permite dividir una tabla en varias tablas f칤sicas mientras que l칩gicamente funcionan como una sola tabla. Esto permite mejorar el rendimiento de las operaciones ya que las operaciones se realizan sobre tablas f칤sicas de menor tama침o. Sin embargo, las consultas que requieren reconstruir la tabla completa son m치s lentas.

```sql
CREATE TABLE <table_name> (<table_definition>)
    PARTITIONED BY [RANGE, LIST, HASH, KEY]
````

### Vistas

Una vista `VIEW` es una tabla virtual (l칩gica), cuya definici칩n se almacena
en el cat치logo o diccionario de la base de datos y se ejecuta cada vez
que se hace referencia a ella en alguna instrucci칩n de la consulta SQL 

```sql
CREATE VIEW <view_name> (<attribute_names>) AS <select_statement>

DROP VIEW <view_name>
```

## Data Manipulation Language (DML)

### Lenguaje de Manipulaci칩n de Datos

La sintaxis para insertar una tupla es 

```sql
INSERT INTO <table_name> (<attributes_name>) VALUES [(<constant_values>), <select_statement>]
```

La sintaxis para eliminar una o varias tuplas es

```sql
DELETE FROM <table_name> WHERE <conditional_expression>
```

Donde todas las tuplas que cumplan la condici칩n `<conditional_expression>` ser치n las eliminadas.

La sintaxis para actualizar una o m치s tuplas es

```sql
UPDATE <table_name> SET [<attribute_name> = <expression>] WHERE <conditional_expression>
```

Al igual que en la cl치usula anterior, las tuplas modificadas son todas aquellas donde se evalue la expresi칩n `<conditional_expression>` como verdadera.

In [16]:
%%sql
INSERT INTO estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) 
VALUES ('Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', '1234', 1);

INSERT INTO estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) 
VALUES ('Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', '5678', 1);

SELECT * FROM estudiante

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
2 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678')]

In [17]:
%%sql
INSERT INTO estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) VALUES ('Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', '9087', 0);
INSERT INTO estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) VALUES ('Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', '4327', 0);

SELECT * FROM estudiante

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
4 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327')]

In [18]:
%%sql
INSERT INTO estudiante (nombre, grupo, provincia, email, no_cuenta) VALUES ('Carlos', 'C311', 'La Habana', 'carlos@matcom.uh.cu', '3579');

SELECT * FROM estudiante;

 * mysql://root:***@localhost:3306
1 rows affected.
5 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327'),
 (5, 'Carlos', 'C311', 'La Habana', 'carlos@matcom.uh.cu', None, '3579')]

쯈u칠 est치 mal en los datos? 쮺칩mo se arregla?

In [19]:
%%sql
INSERT INTO asignatura (nombre) VALUES ('L칩gica');
INSERT INTO asignatura (nombre) VALUES ('츼lgebra');
INSERT INTO asignatura (nombre) VALUES ('An치lisis');
INSERT INTO asignatura (nombre) VALUES ('An치lisis');
INSERT INTO asignatura (nombre) VALUES ('An치lisis');

SELECT * FROM asignatura

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 'L칩gica', 64),
 (2, '츼lgebra', 64),
 (3, 'An치lisis', 64),
 (4, 'An치lisis', 64),
 (5, 'An치lisis', 64)]

쯈u칠 est치 mal en los datos? C칩mo sse arregla?

In [20]:
%%sql 

INSERT INTO calificacion (estudianteid, asignaturaid, nota) VALUES (1, 3, 5);

SELECT * FROM calificacion;

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.

[(1, 3, 5)]

In [ ]:
%sql DELETE FROM estudiante WHERE TRUE

In [21]:
%%sql 

UPDATE estudiante SET grupo = 'C211' WHERE provincia = 'La Habana';
SELECT * FROM estudiante;

 * mysql://root:***@localhost:3306
5 rows affected.
5 rows affected.

[(1, 'Victor', 'C211', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C211', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C211', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C211', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327'),
 (5, 'Carlos', 'C211', 'La Habana', 'carlos@matcom.uh.cu', None, '3579')]

Hemos definido llaves llaves for치neas pero no hemos comprabado su existencia. La siguiente instrucci칩n las muestra.

In [22]:
%sql SELECT * FROM information_schema.KEY_COLUMN_USAGE WHERE TABLE_SCHEMA = 'example_database' AND TABLE_NAME in ('estudiante', 'calificacion')

 * mysql://root:***@localhost:3306
6 rows affected.

[('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'calificacion', 'estudianteid', 1, None, None, None, None),
 ('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'calificacion', 'asignaturaid', 2, None, None, None, None),
 ('def', 'example_database', 'calificacion_ibfk_1', 'def', 'example_database', 'calificacion', 'estudianteid', 1, 1, 'example_database', 'estudiante', 'id'),
 ('def', 'example_database', 'calificacion_ibfk_2', 'def', 'example_database', 'calificacion', 'asignaturaid', 1, 1, 'example_database', 'asignatura', 'id'),
 ('def', 'example_database', 'email', 'def', 'example_database', 'estudiante', 'email', 1, None, None, None, None),
 ('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'estudiante', 'id', 1, None, None, None, None)]